---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient1Slab
source: html/8935c1d1-9788-eea3-8dda-138200d4a002.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient1Slab Property

"Primary Bar - Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinHookOrient1Slab { get; }
```